<?php

$ten=array(
    array('','одна','дві','три','чотири','пять','шість','сім', 'вісім','дев\'ять'),
    array('','одна','дві','три','чотири','пять','шість','сім', 'вісім','дев\'ять'),
);

$a20=array('десять','одинадцять','дванадцять','тринадцять','чотирнадцять' ,'п\'ятнадцять','шістнадцять','сімнадцять','вісімнадцять','дев\'ятнадцять');

$tens=array(2=>'двадцать','тридцять','сорок','п\'ятдесят','шістдесят','сімдесят' ,'вісімдесят','дев\'яносто');

$hundred=array('','сто','двісті','триста','чотириста','пятсот','шістсот', 'сімсот','вісімсот','дев\'ятсот');

$unit = array( // Units
        array('копійка', 'копійки', 'копійок', 1),
        array('гривна', 'гривні', 'гривень', 0),
        array('тисяча', 'тисячі', 'тисяч', 1),
        array('мільйон', 'мільйона', 'мільйонів', 0),
        array('мільярд', 'мільярда', 'мільярдів', 0),
);

return array(
    'nul' => 'нуль',
    'ten' => $ten,
    'a20' => $a20,
    'tens' => $tens,
    'hundred' => $hundred,
    'unit' => $unit
);